{
  "_meta": {
    "maxChars": {
      "_stop_": 0,

      "gameTitle": 60,

      "kwd_start": 12,
      "kwd_newGame": 12,
      "kwd_continue": 12,
      "kwd_controls": 12,
      "kwd_settings": 12,
      "kwd_credits": 12,
      "kwd_licenses": 12,

      "mnu_controls_instruct": 42,
      "mnu_controls_desc": 240,

      "kwd_volume": 12,
      "kwd_bgmVolume": 40,
      "kwd_sfxVolume": 40,
      "kwd_ttsVolume": 40,
      "kwd_mute": 24,
      "kwd_textToSpeech": 24,
      "kwd_tutorial": 24,
      "kwd_back": 12,

      "kwd_saving": 12,
      "wrd_loadSuccess_msg": 250

    }
  },
  "en": {
    "_stop_": "",

    "gameTitle": "Exponent Monsters",

    "kwd_start": "Start",
    "kwd_newGame": "New Game",
    "kwd_continue": "Continue",
    "kwd_controls": "Controls",
    "kwd_settings": "Settings",
    "kwd_credits": "Credits",
    "kwd_licenses": "Licenses",
    "kwd_quit": "Quit",

    "mnu_controls_instruct": "Left Mouse Button/Touch: Interact",
    "mnu_controls_desc": "Use the mouse and its buttons to interact with elements in the game world.",

    "kwd_volume": "Volume",
    "kwd_bgmVolume": "Background Music (BGM) Volume",
    "kwd_sfxVolume": "Sound Effect (SFX) Volume",
    "kwd_ttsVolume": "Text-to-Speech (TTS) Volume",
    "kwd_mute": "Mute",
    "kwd_textToSpeech": "Text-to-Speech",
    "kwd_tutorial": "Tutorial",
    "kwd_back": "Back",

    "kwd_save": "Save",
    "kwd_saving": "Saving...",
    "kwd_loadSuccess_msg": "Save data loaded successfully.",

    "kwd_world": "World",
    "kwd_info": "Info",
    "kwd_powers": "Powers",

    "kwd_power": "Power",

    "kwd_match": "Match",

    "kwd_usePower": "Use Power",
    "kwd_skip": "Skip",

    "mth_matchOver": "The Match is Over!",
    "mth_userWins": "You won!",
    "mth_oppWins": "The opponent won!",



    "trl_opening_00": "Welcome to the exponent club! As the name suggests, we play the exponent game here. Do you want to play? Oh, you’ve never played the game before? I guess the club will have to teach you then! Challenge me to a match, and I’ll show you the ropes!",
    "trl_firstMatch_00": "The exponent game is pretty symbol. You and your opponent will both be given equations with missing values, which can be numbers or operations. You need to pick the right value from your puzzle board to complete the equation. When the equation is complete, you get points, and move onto the next equation. The player fills their points bar first wins. Good luck!",
    "trl_firstMatchLoss_00": "You’ve lost the introductory match. It’s important that you learn this rule before going forward, so please try again.",
    "trl_firstMatchWin_00": "Congratulations on winning the introduction match! Now that you’re familiar with the rules, you’ll have to beat every member of the club! Each member focuses on one or more exponent rules, so you’ll get introduced to each rule one at a time. You’ll be a master at this in no time. Good luck!",
    "trl_firstPower_00": "You just got a match power! A power can be used to give you an edge during a match, but only after building up its energy first. When you defeat a challenger, you also receive the power, which you can equip for future matches. Check the power menu to see what each power does, and select what power you want.",
    "trl_finalMatch_00": "You’ve learned all the exponent rules and defeated all the other club members, so now it’s time for your final challenge: a match against me! Head over to the next room so we can face off!",
    "trl_gameOver_00": "You got a game over. You can rematch your opponent now, or try to take on any other available challengers. However, you’ll need to beat all the club members to clear this trial, so be ready to come back at some point.",

    "trl_exponent_00": "Time to teach you some exponent basics. Exponents are math operations where you multiply a value by itself a certain number of times, with said number being determined by the exponent. Exponent operations have multiple rules, which will be explained later.",
    "trl_product_00": "This match uses the product rule. When two terms with the same base are multiplied together, it can be simplified to multiplying the base by the sum of the exponents.",
    "trl_powerOfAPower_00": "This match uses the power of a power rule. When a term with an exponent is having its result get another exponent applied to it, it can be converted to the base value to a single, combined exponent. The combined exponent is the two exponents from the original expression multiplied together.",
    "trl_powerOfAProduct_00": "This match uses the power of a product rule. If two terms with different bases and the same exponents are multiplied, the bases are multiplied together, with their result being put to the power of the shared exponent.",
    "trl_zero_00": "This match uses the zero exponent rule. Any value to the power of 0 will give the result of 1.",
    "trl_negative_00": "This match uses the negative exponent rule. The negative exponent rule dictates that any value to the power of a negative exponent becomes a fraction with a numerator of 1. The value with the exponent applied becomes the denominator."
  }
}
